#### Terraform Plan: ✅

<details>
<summary>Show</summary>

```terraform
[command]/home/runner/work/_temp/249f56de-7a82-4101-83f2-c27fd40144dc/terraform-bin plan
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/lqc63d-sandbox/runs/run-x3KBWBs6CiHX86Pe

Waiting for the plan to start...

Terraform v1.0.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.this["another-ecr"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "another-ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.this["ssp"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ssp"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.this["another-ecr"] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::93135233083:root"
                        }
                      + Sid       = "ECRRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "another-ecr"
    }

  # aws_ecr_repository_policy.this["ssp"] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::93135233083:root"
                        }
                      + Sid       = "ECRRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "ssp"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + repository_urls = [
      + (known after apply),
      + (known after apply),
    ]

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Resources: 0 of 2 estimated
           $0.0/mo +$0.0
::debug::Terraform exited with code 0.
::debug::stdout: Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/lqc63d-sandbox/runs/run-x3KBWBs6CiHX86Pe%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.0.4%0Aon linux_amd64%0AConfiguring remote state backend...%0AInitializing Terraform configuration...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecr_repository.this["another-ecr"] will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "another-ecr"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = (known after apply)%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # aws_ecr_repository.this["ssp"] will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "ssp"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = (known after apply)%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # aws_ecr_repository_policy.this["another-ecr"] will be created%0A  + resource "aws_ecr_repository_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "ecr:ListImages",%0A                          + "ecr:GetRepositoryPolicy",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:DescribeRepositories",%0A                          + "ecr:DescribeImages",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::93135233083:root"%0A                        }%0A                      + Sid       = "ECRRead"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + registry_id = (known after apply)%0A      + repository  = "another-ecr"%0A    }%0A%0A  # aws_ecr_repository_policy.this["ssp"] will be created%0A  + resource "aws_ecr_repository_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "ecr:ListImages",%0A                          + "ecr:GetRepositoryPolicy",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:DescribeRepositories",%0A                          + "ecr:DescribeImages",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::93135233083:root"%0A                        }%0A                      + Sid       = "ECRRead"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + registry_id = (known after apply)%0A      + repository  = "ssp"%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + repository_urls = [%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AWaiting for cost estimate to complete...%0A%0AResources: 0 of 2 estimated%0A           $0.0/mo +$0.0%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/lqc63d-sandbox/runs/run-x3KBWBs6CiHX86Pe%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.0.4%0Aon linux_amd64%0AConfiguring remote state backend...%0AInitializing Terraform configuration...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecr_repository.this["another-ecr"] will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "another-ecr"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = (known after apply)%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # aws_ecr_repository.this["ssp"] will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "ssp"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = (known after apply)%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # aws_ecr_repository_policy.this["another-ecr"] will be created%0A  + resource "aws_ecr_repository_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "ecr:ListImages",%0A                          + "ecr:GetRepositoryPolicy",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:DescribeRepositories",%0A                          + "ecr:DescribeImages",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::93135233083:root"%0A                        }%0A                      + Sid       = "ECRRead"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + registry_id = (known after apply)%0A      + repository  = "another-ecr"%0A    }%0A%0A  # aws_ecr_repository_policy.this["ssp"] will be created%0A  + resource "aws_ecr_repository_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "ecr:ListImages",%0A                          + "ecr:GetRepositoryPolicy",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:DescribeRepositories",%0A                          + "ecr:DescribeImages",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::93135233083:root"%0A                        }%0A                      + Sid       = "ECRRead"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + registry_id = (known after apply)%0A      + repository  = "ssp"%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + repository_urls = [%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AWaiting for cost estimate to complete...%0A%0AResources: 0 of 2 estimated%0A           $0.0/mo +$0.0%0A
::set-output name=stderr::
::set-output name=exitcode::0

```

</details>

*Pusher:* @yasserhu, *Action:* [Terraform Plan Sandbox: #1](https://github.com/yasserhu/startup-sample-project/actions/runs/1144400715)